[
  {
    "id": "strategist",
    "name": "The Strategist",
    "primaryDimensions": ["assertiveness", "conscientiousness"],
    "icon": "🎯",
    "shortDescription": "Decisive planners who combine clear direction with thorough preparation.",
    "narrative": "As a Strategist, you bring together decisive leadership with meticulous planning. You don't just set ambitious goals—you create detailed roadmaps to achieve them. Your combination of confidence and thoroughness makes you particularly effective at turning vision into executable action. You're the person teams turn to when they need both direction and a concrete plan.",
    "strengths": [
      "Creating comprehensive plans with clear action steps and accountability",
      "Making confident decisions backed by thorough analysis and preparation",
      "Holding yourself and others to high standards while maintaining forward momentum",
      "Anticipating obstacles and developing contingency plans before problems arise"
    ],
    "blindSpots": [
      "May come across as overly controlling or micromanaging when stressed",
      "Can struggle to delegate because of high standards for both outcomes and process",
      "Might resist improvisation or course corrections once a plan is in place"
    ],
    "careerPaths": [
      "Project Management and Program Leadership",
      "Operations and Process Improvement",
      "Strategic Planning and Business Analysis",
      "Management Consulting"
    ],
    "teamRole": "You serve as the architect of team success, providing both vision and structure. You excel at breaking down complex initiatives into manageable steps and ensuring everyone understands their role. Your team appreciates your ability to anticipate what's needed and plan accordingly.",
    "leadershipStyle": "You lead through clear expectations and organized execution. You set ambitious targets and create the systems to achieve them. Your direct reports know exactly where they stand and what's expected, though they may sometimes wish for more flexibility or spontaneity.",
    "stressTriggers": [
      "Last-minute changes that disrupt carefully laid plans",
      "Team members who miss deadlines or don't follow established processes",
      "Situations requiring quick decisions without adequate information"
    ],
    "copingStrategies": [
      "Build buffer time into plans to accommodate unexpected changes",
      "Practice delegating smaller decisions to trusted team members",
      "Develop comfort with 'good enough' solutions when perfection isn't feasible",
      "Schedule regular check-ins rather than trying to control every detail"
    ]
  },
  {
    "id": "visionary",
    "name": "The Visionary",
    "primaryDimensions": ["creativity", "flexibility"],
    "icon": "🌟",
    "shortDescription": "Boundary-pushing innovators who transform ideas into breakthrough solutions.",
    "narrative": "As a Visionary, you see connections and possibilities that others miss. Your mind naturally generates novel solutions to complex problems, and you have the adaptability to pursue them even when the path forward is unclear. You don't just think outside the box—you question whether the box was ever necessary. Your combination of creative thinking and flexibility makes you a powerful force for innovation and transformation.",
    "strengths": [
      "Generating breakthrough ideas that challenge conventional thinking",
      "Adapting quickly as you learn and discover new possibilities",
      "Inspiring others to see potential in what currently seems impossible",
      "Connecting disparate concepts to create something entirely new"
    ],
    "blindSpots": [
      "May generate more ideas than you can realistically execute",
      "Can become frustrated with necessary processes or practical constraints",
      "Might lose interest once the initial creative challenge is solved"
    ],
    "careerPaths": [
      "Product Innovation and R&D Leadership",
      "Creative Direction and Design Strategy",
      "Entrepreneurship and Startup Founding",
      "Strategic Foresight and Future Planning"
    ],
    "teamRole": "You help teams see beyond current limitations and imagine what's possible. You bring fresh perspectives that break through groupthink and challenge comfortable assumptions. While others execute today's work, you're already thinking about tomorrow's opportunities.",
    "leadershipStyle": "You inspire people toward ambitious visions rather than directing detailed execution. You create space for experimentation and don't punish failure when it leads to learning. Your team values your ability to see potential in them and their ideas.",
    "stressTriggers": [
      "Rigid environments that discourage experimentation",
      "Being forced to follow established methods without room for innovation",
      "Excessive focus on short-term results over long-term potential"
    ],
    "copingStrategies": [
      "Partner with detail-oriented colleagues who can help execute your ideas",
      "Set specific criteria for which ideas to pursue versus which to set aside",
      "Build in time for creative exploration even during busy periods",
      "Learn to value incremental progress alongside breakthrough moments"
    ]
  },
  {
    "id": "craftsman",
    "name": "The Craftsman",
    "primaryDimensions": ["conscientiousness", "creativity"],
    "icon": "⚒️",
    "shortDescription": "Dedicated artisans who blend meticulous execution with creative excellence.",
    "narrative": "As a Craftsman, you combine painstaking attention to detail with genuine creative flair. You're not satisfied with merely completing tasks—you strive for excellence in execution while bringing artistry and intentionality to your work. Whether you're designing systems, creating content, or building products, you care deeply about both how things work and how they feel. Your dedication to craft sets the quality standard for everyone around you.",
    "strengths": [
      "Producing work that demonstrates exceptional attention to detail and artistry",
      "Developing innovative solutions within practical constraints",
      "Maintaining high standards while bringing creativity to routine tasks",
      "Creating systems and processes that balance efficiency with elegance"
    ],
    "blindSpots": [
      "May spend excessive time perfecting details that don't significantly impact outcomes",
      "Can become frustrated when others don't share your commitment to quality",
      "Might resist delegation because others won't meet your standards"
    ],
    "careerPaths": [
      "Technical Architecture and Systems Design",
      "UX/UI Design and Product Craft",
      "Content Creation and Editorial Leadership",
      "Quality Assurance and Excellence Programs"
    ],
    "teamRole": "You set the quality bar for your team and inspire others to care about excellence. You notice details others miss and ensure the final product reflects well on everyone involved. While others rush toward deadlines, you advocate for taking time to get things right.",
    "leadershipStyle": "You mentor others toward mastery rather than merely assigning tasks. You demonstrate excellence through your own work and provide detailed guidance when coaching others. Your team learns from watching how thoughtfully you approach challenges.",
    "stressTriggers": [
      "Pressure to compromise quality for speed",
      "Working with teammates who cut corners or overlook details",
      "Projects where craftsmanship isn't valued or appreciated"
    ],
    "copingStrategies": [
      "Identify which aspects of quality genuinely matter versus perfectionism",
      "Partner with pragmatic colleagues who help balance excellence with practicality",
      "Educate stakeholders about why craftsmanship saves time and resources long-term",
      "Celebrate incremental improvements rather than demanding perfection immediately"
    ]
  },
  {
    "id": "connector",
    "name": "The Connector",
    "primaryDimensions": ["sociability", "emotional_intelligence"],
    "icon": "🤝",
    "shortDescription": "Relationship builders who create strong networks through empathy and engagement.",
    "narrative": "As a Connector, you excel at building bridges between people and ideas. You don't just network—you genuinely understand what motivates different individuals and how to bring them together effectively. Your combination of social energy and emotional awareness makes you a natural facilitator and team builder. People feel heard and valued in your presence, and you have an uncanny ability to match people with opportunities and each other.",
    "strengths": [
      "Building genuine relationships across diverse teams and stakeholder groups",
      "Reading emotional undercurrents in meetings and addressing unspoken concerns",
      "Creating inclusive environments where different perspectives are welcomed",
      "Facilitating difficult conversations by understanding all sides of an issue"
    ],
    "blindSpots": [
      "May prioritize harmony over necessary conflict or tough decisions",
      "Can become overwhelmed by others' emotions and needs",
      "Might avoid giving direct critical feedback to preserve relationships"
    ],
    "careerPaths": [
      "Human Resources and Talent Development",
      "Account Management and Client Relations",
      "Change Management and Organizational Development",
      "Team Leadership and People Management"
    ],
    "teamRole": "You're the glue that holds teams together, especially during transitions or conflicts. You notice when someone is disengaged and reach out. You facilitate connections between people who should know each other. Your team values your ability to maintain morale and resolve interpersonal tensions.",
    "leadershipStyle": "You lead through relationships and inclusion. You know your people—their strengths, concerns, and aspirations. Your team feels personally invested in success because you've invested in them. However, you may need to push yourself to make unpopular decisions when necessary.",
    "stressTriggers": [
      "Team conflict or interpersonal tensions that you can't immediately resolve",
      "Working in isolation without regular interaction with others",
      "Environments that prioritize tasks over people and relationships"
    ],
    "copingStrategies": [
      "Set boundaries to avoid taking on everyone's emotional burdens",
      "Practice direct communication even when it feels uncomfortable",
      "Remember that healthy conflict can lead to better outcomes",
      "Schedule time for relationship-building even during busy periods"
    ]
  },
  {
    "id": "catalyst",
    "name": "The Catalyst",
    "primaryDimensions": ["sociability", "assertiveness"],
    "icon": "⚡",
    "shortDescription": "Dynamic mobilizers who drive action through confident engagement.",
    "narrative": "As a Catalyst, you combine social energy with confident direction to mobilize people toward bold goals. You're not just a networker—you're someone who builds relationships specifically to drive action and results. You know how to read a room, identify what needs to happen, and inspire people to make it happen. Your ability to connect with others while maintaining clear direction makes you particularly effective at leading change and building momentum.",
    "strengths": [
      "Building coalitions and getting buy-in for ambitious initiatives",
      "Reading group dynamics and adjusting your approach to move people forward",
      "Inspiring confidence and commitment through personal connection and clear direction",
      "Turning relationships into productive collaborations and partnerships"
    ],
    "blindSpots": [
      "May move people toward action before they're fully ready or committed",
      "Can become frustrated when others don't share your sense of urgency",
      "Might prioritize relationship-building over relationship depth"
    ],
    "careerPaths": [
      "Sales Leadership and Business Development",
      "Change Management and Transformation",
      "Political and Community Organizing",
      "Strategic Partnerships and Alliances"
    ],
    "teamRole": "You're the energizer who gets people moving and keeps momentum going. You identify blockers and either remove them yourself or connect people who can work together to solve problems. Your team appreciates your ability to maintain energy and optimism even during challenging periods.",
    "leadershipStyle": "You lead through inspiration and activation. You build relationships quickly and use them to drive toward results. Your team knows what needs to happen and feels motivated to make it happen, though they may sometimes need you to slow down and provide more detailed guidance.",
    "stressTriggers": [
      "Slow-moving processes or bureaucratic obstacles that prevent action",
      "Team members who don't engage or commit to shared goals",
      "Working in isolation without opportunities to energize and mobilize others"
    ],
    "copingStrategies": [
      "Practice patience and give people adequate time to process and commit",
      "Develop deeper relationships rather than constantly building new ones",
      "Balance your drive for action with appreciation for thoughtful deliberation",
      "Focus on quality of engagement rather than quantity of connections"
    ]
  },
  {
    "id": "analyst",
    "name": "The Analyst",
    "primaryDimensions": ["conscientiousness", "risk_appetite"],
    "icon": "🔍",
    "shortDescription": "Thorough thinkers who deliver insights through careful analysis and measured judgment.",
    "narrative": "As an Analyst, you bring together meticulous attention to detail with careful, risk-aware judgment. You don't just gather data—you dive deep to uncover insights others miss, and you do so with a clear understanding of potential pitfalls and consequences. Your combination of thoroughness and caution makes you invaluable when decisions carry significant consequences. You're the person others turn to when they need to understand all the angles before moving forward.",
    "strengths": [
      "Conducting thorough analysis that uncovers insights others miss",
      "Identifying risks and potential problems before they materialize",
      "Maintaining focus on complex problems without rushing to premature solutions",
      "Producing accurate, well-documented work that withstands scrutiny"
    ],
    "blindSpots": [
      "May over-analyze situations where quick decisions are needed",
      "Can get caught in details and lose sight of broader strategic context",
      "Might be reluctant to share insights before feeling they're fully developed"
    ],
    "careerPaths": [
      "Data Analysis and Business Intelligence",
      "Financial Analysis and Risk Management",
      "Research and Development",
      "Technical Architecture and Systems Design"
    ],
    "teamRole": "You're the expert who ensures decisions are based on solid evidence rather than assumptions. Your team relies on you to catch errors, identify patterns, and provide the depth of analysis needed for important decisions. You help prevent costly mistakes through thorough examination.",
    "leadershipStyle": "You lead through expertise and careful guidance. You help others develop strong analytical skills and appreciation for thoroughness. Your team learns to value accuracy and thoughtfulness, though they may sometimes need you to provide direction more quickly.",
    "stressTriggers": [
      "Pressure to provide analysis or recommendations before you're ready",
      "Incomplete or poor-quality data that undermines your ability to be thorough",
      "Fast-paced environments that prioritize speed over accuracy"
    ],
    "copingStrategies": [
      "Develop frameworks for quick assessments when deep analysis isn't feasible",
      "Practice communicating preliminary findings with appropriate caveats",
      "Set clear scopes for analysis to prevent endless investigation",
      "Remember that imperfect information is sometimes enough for good decisions"
    ]
  },
  {
    "id": "creator",
    "name": "The Creator",
    "primaryDimensions": ["creativity", "emotional_intelligence"],
    "icon": "🎨",
    "shortDescription": "Empathetic innovators who craft meaningful experiences through creative insight.",
    "narrative": "As a Creator, you blend imaginative thinking with deep empathy to craft experiences, solutions, and works that resonate on an emotional level. You're not just creative—you're creatively attuned to how people feel and what they need. Whether you're designing products, creating content, or solving problems, you naturally consider both innovation and human impact. Your work doesn't just function well; it connects with people.",
    "strengths": [
      "Designing solutions that are both innovative and emotionally resonant",
      "Understanding user needs and translating them into creative approaches",
      "Bringing artistry and humanity to technical or routine work",
      "Creating experiences that people remember and value"
    ],
    "blindSpots": [
      "May prioritize creative vision over practical constraints",
      "Can become emotionally attached to your creations, making feedback difficult",
      "Might struggle with aspects of work that feel purely functional or administrative"
    ],
    "careerPaths": [
      "UX/UI Design and Product Experience",
      "Content Creation and Creative Direction",
      "Brand Strategy and Experience Design",
      "Innovation Consulting with Human Focus"
    ],
    "teamRole": "You bring humanity and creativity to everything your team does. You ensure solutions aren't just functional but meaningful. You notice how people respond to what you create and use those insights to make things better. Your team values your ability to make work more engaging and impactful.",
    "leadershipStyle": "You lead through inspiration and empathy. You help people connect with the deeper purpose behind their work and bring their own creativity forward. Your team feels valued as whole people, not just workers, which unlocks their full potential.",
    "stressTriggers": [
      "Environments that dismiss creativity or emotional factors as unimportant",
      "Working on projects that feel purely functional without human impact",
      "Receiving criticism that feels dismissive of your creative vision"
    ],
    "copingStrategies": [
      "Seek roles and projects where creativity and empathy are valued",
      "Develop thicker skin around feedback while staying connected to your vision",
      "Partner with pragmatic colleagues who can help with execution details",
      "Remember that constraints often spark more creative solutions than complete freedom"
    ]
  },
  {
    "id": "maverick",
    "name": "The Maverick",
    "primaryDimensions": ["assertiveness", "risk_appetite"],
    "icon": "🔥",
    "shortDescription": "Bold trailblazers who chart new territory through confident risk-taking.",
    "narrative": "As a Maverick, you combine confident leadership with comfort for risk and uncertainty. You're not reckless—you're calculated in your willingness to pursue opportunities others deem too uncertain. You trust your instincts and aren't afraid to challenge conventional wisdom or established practices. Your combination of bold direction and risk tolerance makes you particularly effective at pioneering new initiatives and disrupting stagnant situations.",
    "strengths": [
      "Championing bold initiatives that others consider too risky",
      "Making decisive moves with incomplete information when opportunities arise",
      "Learning quickly from failures and adjusting course without hesitation",
      "Inspiring confidence in uncertain ventures through personal conviction"
    ],
    "blindSpots": [
      "May underestimate genuine risks or fail to adequately prepare for challenges",
      "Can become impatient with necessary caution or thorough planning",
      "Might alienate risk-averse colleagues who feel pressured to move faster than they're comfortable"
    ],
    "careerPaths": [
      "Entrepreneurship and Venture Creation",
      "Business Development and Strategic Growth",
      "Innovation Leadership and Disruption",
      "Turnaround Management and Transformation"
    ],
    "teamRole": "You're the catalyst for bold action and breakthrough thinking. You challenge comfortable assumptions and push boundaries constructively. While others analyze risks, you're willing to try approaches that seem unconventional but promising.",
    "leadershipStyle": "You lead through bold vision and personal conviction. You're willing to take calculated risks and stand by your decisions. Your team learns to embrace uncertainty and trust their instincts. However, you need to balance your appetite for risk with appreciation for thoughtful preparation.",
    "stressTriggers": [
      "Overly cautious environments where bold ideas are dismissed without consideration",
      "Bureaucratic processes that slow down action and innovation",
      "Working with people who focus on why things won't work rather than how they might"
    ],
    "copingStrategies": [
      "Develop stronger risk assessment skills to complement your natural boldness",
      "Partner with analytical colleagues who can identify pitfalls you might miss",
      "Practice patience with others who need more time to get comfortable with uncertainty",
      "Remember that calculated risks include preparing for multiple scenarios"
    ]
  }
]