{
  "assertiveness": {
    "name": "Assertiveness",
    "description": "Your tendency to take initiative, speak up confidently, and drive action.",
    "lowScore": {
      "range": [0, 33],
      "narrative": "You tend to take a more reserved approach to leadership and decision-making. You're comfortable letting others take the lead and prefer to contribute through careful input rather than bold direction. This doesn't mean you lack opinions—you simply choose your moments to speak up and may prefer to influence through thoughtful suggestions rather than direct commands. In team settings, you're more likely to listen first and speak later, which allows you to offer well-considered perspectives.",
      "stressBehavior": "Under pressure, this tendency may become more pronounced. You might find yourself deferring to others even when you have valuable insights, or hesitating on decisions that require quick action. Conversely, some people with lower assertiveness scores become uncharacteristically forceful when stressed, as accumulated frustration overrides their usual measured approach.",
      "scenarios": [
        "Team Meeting: When the group is debating between two project approaches, you listen to all arguments before offering a synthesis of what you've heard, rather than immediately advocating for your preferred option.",
        "Conflict Situation: When a colleague challenges your work, you may take time to consider their perspective rather than immediately defending your position, sometimes to the point of doubting yourself.",
        "Leadership Moment: When your team needs direction during a crisis, you might gather input from multiple people before deciding, which provides good perspective but can feel slow to those wanting immediate action."
      ],
      "developmentTips": [
        "Practice speaking up early in meetings, even with incomplete thoughts, to build comfort with asserting yourself.",
        "Recognize that waiting for perfect information often means missing the opportunity to influence decisions.",
        "Remember that your perspective has value—teams benefit from hearing diverse viewpoints, including yours.",
        "Start with lower-stakes situations to build your confidence in taking initiative."
      ]
    },
    "mediumScore": {
      "range": [34, 66],
      "narrative": "You show a balanced approach to assertiveness, stepping forward when the situation calls for it while being comfortable in supportive roles at other times. You read the context and adjust your level of directness accordingly. This flexibility serves you well across different team dynamics and situations. You're neither the person who always needs to be in charge nor the one who consistently defers to others—you find the middle ground based on what the situation requires.",
      "stressBehavior": "Under pressure, you might swing between being more assertive than usual and retreating into a more passive stance, depending on the type of stress and how confident you feel about the situation. This variability is normal but can sometimes confuse colleagues who aren't sure which version of you will show up during high-pressure moments.",
      "scenarios": [
        "Team Meeting: You contribute actively to discussions, sometimes taking the lead on topics where you have expertise while supporting others when they're better positioned to guide the conversation.",
        "Conflict Situation: You address disagreements directly when necessary but choose your battles, speaking up on important issues while letting minor conflicts resolve themselves.",
        "Leadership Moment: When your team needs direction, you step up if no one else is taking charge, but you're equally comfortable supporting someone else's leadership when they're driving effectively."
      ],
      "developmentTips": [
        "Pay attention to patterns in when you step forward versus hold back—ensure it's based on strategic judgment rather than comfort level.",
        "Develop clarity about which situations genuinely warrant your leadership and which benefit from supporting others.",
        "Work on consistency so colleagues know they can count on you to speak up on critical issues.",
        "Practice asserting yourself in your areas of expertise to build confidence that extends to other domains."
      ]
    },
    "highScore": {
      "range": [67, 100],
      "narrative": "You naturally step into leadership roles and speak up confidently in most situations. You're comfortable making decisions, even difficult ones, and have little hesitation about advocating for your perspective or taking charge when direction is needed. Your confidence in asserting yourself helps teams move forward decisively. You believe in the value of your ideas and aren't shy about sharing them, which often positions you as an informal or formal leader in group settings.",
      "stressBehavior": "Under pressure, you typically become even more directive and decisive. You may take charge more forcefully, make quicker decisions, and communicate more directly—sometimes to the point of appearing domineering if you're not careful. Your natural assertiveness can intensify into impatience with process or consultation when you feel urgency.",
      "scenarios": [
        "Team Meeting: When discussion becomes circular or unfocused, you step in to synthesize viewpoints and push for a decision, often becoming the de facto facilitator even if you're not officially leading the meeting.",
        "Conflict Situation: You address disagreements head-on, clearly stating your position and expecting others to do the same. You prefer direct confrontation to letting issues fester.",
        "Leadership Moment: In a crisis, you naturally take charge, organizing people and resources and making rapid decisions with the information available, even if it's incomplete."
      ],
      "developmentTips": [
        "Make space for others to lead and contribute—your strong voice can sometimes overshadow quieter colleagues with valuable insights.",
        "Practice asking questions and listening before jumping to advocacy, especially on topics outside your expertise.",
        "Recognize that decisiveness is valuable, but some decisions benefit from more consultation and consideration.",
        "Pay attention to how your directness lands with different personality types and adjust your approach accordingly."
      ]
    }
  },
  "sociability": {
    "name": "Sociability",
    "description": "Your preference for social interaction, collaboration, and relationship-building.",
    "lowScore": {
      "range": [0, 33],
      "narrative": "You're energized by focused, independent work and find extensive social interaction draining. This doesn't mean you're unfriendly—you simply have a more limited capacity for social engagement and need time alone to recharge. You probably prefer working with a small group of familiar colleagues rather than constantly meeting new people or participating in large group activities. You build relationships slowly and selectively, but the connections you form tend to be deep and genuine.",
      "stressBehavior": "When under pressure, your preference for solitude typically intensifies. You may withdraw from social interactions, become less responsive to messages, and prefer to work through problems independently rather than seeking support from others. This can sometimes leave teammates feeling shut out when you most need collaboration.",
      "scenarios": [
        "Team Meeting: You contribute when you have something specific to add but don't engage in much small talk or social interaction before or after. You may feel drained by long meetings with multiple people.",
        "Conflict Situation: You prefer to address issues one-on-one or via written communication rather than in group settings, and you need time to process before responding to interpersonal challenges.",
        "Leadership Moment: You lead through expertise and clear direction rather than through relationship-building, which is effective but may create distance between you and your team."
      ],
      "developmentTips": [
        "Schedule social interaction deliberately so you can prepare mentally and reserve energy for it.",
        "Recognize that building relationships, while draining, is often essential for career advancement and project success.",
        "Find small ways to stay connected with colleagues without overwhelming yourself—brief check-ins can be enough.",
        "Communicate your working style to teammates so they understand your need for independent work time."
      ]
    },
    "mediumScore": {
      "range": [34, 66],
      "narrative": "You're comfortable with both collaboration and independent work, moving flexibly between social interaction and focused solo time. You enjoy working with others but also appreciate the opportunity to concentrate without interruption. You don't necessarily seek out social interaction constantly, but you engage willingly when the situation calls for it. This balance allows you to adapt to various work environments and team structures.",
      "stressBehavior": "Under pressure, you might lean more heavily toward either collaboration or isolation depending on the nature of the stress and your assessment of what will be most productive. Some stressful situations push you toward seeking support from others, while different pressures make you want to retreat and work independently.",
      "scenarios": [
        "Team Meeting: You participate actively in discussions and engage in some social interaction, but you're equally content when meetings are focused and efficient versus when they're more social and relationship-oriented.",
        "Conflict Situation: You're comfortable addressing issues in group settings when necessary but also value one-on-one conversations for more sensitive matters. Your approach depends on the specific situation.",
        "Leadership Moment: You balance relationship-building with task focus, connecting with your team while also ensuring work moves forward efficiently."
      ],
      "developmentTips": [
        "Be intentional about when you choose collaboration versus independent work—ensure it's strategic rather than just comfortable.",
        "Develop awareness of team members who need more or less social interaction than you do, and adjust accordingly.",
        "Build relationships proactively during calmer periods so you have strong connections when you need collaboration under pressure.",
        "Notice whether you tend to default to solo or collaborative work under stress, and push yourself in the opposite direction occasionally."
      ]
    },
    "highScore": {
      "range": [67, 100],
      "narrative": "You thrive on social interaction and relationship-building. You're energized by collaboration, enjoy meeting new people, and actively maintain a broad network of professional connections. You probably prefer working in teams to working alone and may struggle with roles that require extensive solitary work. Your natural sociability helps you build coalitions, facilitate collaboration, and create positive team dynamics. You likely have strong relationships across different teams and departments.",
      "stressBehavior": "Under pressure, you typically seek out collaboration and support from others rather than isolating yourself. However, if stress becomes extreme, you might actually withdraw—which can surprise colleagues who are used to your outgoing nature. Alternatively, you might maintain your social engagement but become less authentic or more scattered as you try to connect with too many people simultaneously.",
      "scenarios": [
        "Team Meeting: You actively engage with everyone before, during, and after meetings. You often facilitate introductions, build on others' ideas, and help create an inclusive atmosphere where people feel comfortable contributing.",
        "Conflict Situation: You address interpersonal issues through dialogue and relationship repair, preferring to talk through problems rather than avoiding difficult conversations or relying on formal processes.",
        "Leadership Moment: You lead through relationship and influence, building strong personal connections with team members and leveraging those relationships to motivate and guide people."
      ],
      "developmentTips": [
        "Recognize that some colleagues are drained by the level of interaction you find energizing—give them space when needed.",
        "Build in independent work time for tasks requiring deep focus, even though collaboration is more appealing.",
        "Be mindful that relationship-building, while valuable, must be balanced with task completion and results.",
        "Ensure your broad network includes some deeper relationships rather than being entirely surface-level connections."
      ]
    }
  },
  "patience": {
    "name": "Patience",
    "description": "Your ability to remain calm under pressure and tolerate ambiguity or delays.",
    "lowScore": {
      "range": [0, 33],
      "narrative": "You operate with a sense of urgency and have limited tolerance for delays, ambiguity, or slow processes. You want clarity, action, and results—preferably now. This drive creates momentum and prevents teams from getting stuck in analysis paralysis, but it can also lead to impatience when situations require careful consideration or when working with people who move at a different pace. You may feel frustrated in environments with significant uncertainty or frequent changes.",
      "stressBehavior": "Under pressure, your impatience typically intensifies. You become more demanding of quick answers, less tolerant of delays or mistakes, and more likely to push people to move faster. This urgency can be helpful in crisis situations but may damage relationships or lead to hasty decisions if not managed carefully.",
      "scenarios": [
        "Team Meeting: When discussion becomes detailed or goes off track, you become visibly impatient and push to reach conclusions quickly. You may interrupt or redirect conversations that feel unproductive.",
        "Conflict Situation: You want to resolve issues immediately and can become frustrated when others need time to process or when solutions aren't straightforward. You prefer quick, decisive action to prolonged discussion.",
        "Leadership Moment: When your team faces an ambiguous situation, you push for rapid decisions even with incomplete information, which creates momentum but sometimes leads to needing course corrections later."
      ],
      "developmentTips": [
        "Build in processing time before reacting to delays or setbacks—your initial reaction is often more intense than the situation warrants.",
        "Recognize that some problems genuinely require time and deliberation to solve well.",
        "Practice tolerance for ambiguity by deliberately working on complex, uncertain challenges where quick answers don't exist.",
        "Communicate your need for clarity and action while respecting that others may need different pacing."
      ]
    },
    "mediumScore": {
      "range": [34, 66],
      "narrative": "You show reasonable patience in most situations while still maintaining standards for timely action and clarity. You can tolerate some ambiguity and delays without becoming overly frustrated, but you also push back when patience crosses into unnecessary waiting or avoidance. This balanced approach allows you to adapt to different situations—staying calm when circumstances require patience while maintaining momentum when delays are unjustified.",
      "stressBehavior": "Under pressure, your patience may decrease, leading you to push harder for clarity and resolution. However, you're less likely to lose your composure entirely compared to those with lower patience scores. The key is recognizing when stress is eroding your patience and managing that reaction consciously.",
      "scenarios": [
        "Team Meeting: You participate in thorough discussions when warranted but also speak up when conversations become unnecessarily prolonged. You balance patience for the process with keeping things moving.",
        "Conflict Situation: You give people reasonable time to respond and work through issues but set clear expectations for when resolution needs to occur. You don't let conflicts fester indefinitely.",
        "Leadership Moment: When facing uncertainty, you gather available information without endless analysis, then move forward even if some ambiguity remains. You balance patience with action."
      ],
      "developmentTips": [
        "Develop clearer frameworks for when patience is valuable versus when urgency is appropriate.",
        "Notice your triggers for impatience and whether they're rational responses or automatic reactions.",
        "Practice extending patience in low-stakes situations to build capacity for high-stakes ambiguity.",
        "Communicate your expectations for timing clearly rather than assuming others share your sense of pacing."
      ]
    },
    "highScore": {
      "range": [67, 100],
      "narrative": "You maintain composure and calm even in uncertain or frustrating situations. You're comfortable with ambiguity and don't feel compelled to rush toward answers before sufficient consideration. This patience allows you to think clearly when others are reactive and to persist through complex problems that don't have quick solutions. You're the steady presence that helps teams stay rational during challenges. However, your high patience may sometimes be perceived as passivity or lack of urgency.",
      "stressBehavior": "Under pressure, you typically maintain your composure and may actually become even more patient and methodical. However, others who are feeling urgency may find your steady pace frustrating. In extreme stress, your patience might shift to withdrawal or resignation rather than active calm.",
      "scenarios": [
        "Team Meeting: You listen calmly to all perspectives, even when discussion becomes heated or circular. You help de-escalate tensions and bring rational thinking to emotional situations.",
        "Conflict Situation: You take time to understand all sides of an issue and don't rush toward resolution before everyone has processed the situation. You remain calm even when others are upset or frustrated.",
        "Leadership Moment: When your team faces uncertainty, you provide steady guidance without panic or rushed decisions. You help people stay focused on what can be controlled rather than reacting to every development."
      ],
      "developmentTips": [
        "Recognize situations that genuinely require faster action, even if you're comfortable with the current pace.",
        "Balance your patience with ensuring momentum—sometimes 'good enough' decisions made timely are better than perfect decisions made late.",
        "Communicate your thinking process so others understand your patience is strategic rather than passive.",
        "Be aware that your calm can sometimes be misread as lack of concern or urgency about important issues."
      ]
    }
  },
  "flexibility": {
    "name": "Flexibility",
    "description": "Your adaptability and openness to change, new approaches, and uncertainty.",
    "lowScore": {
      "range": [0, 33],
      "narrative": "You prefer established processes, clear structures, and consistency in how work gets done. Change—especially unexpected change—feels disruptive and uncomfortable. You value having predictable routines and methods you can rely on. This preference for stability allows you to develop deep expertise in established approaches and to create reliable, consistent results. However, it can make you resistant to necessary changes or innovations, and you may struggle in highly dynamic environments.",
      "stressBehavior": "Under pressure, you typically cling more tightly to familiar methods and become more resistant to changes or new approaches. Stress reduces your capacity to adapt, making you more rigid in your thinking and less open to alternative solutions. You may dismiss new ideas more quickly or insist on following established procedures even when they're not working.",
      "scenarios": [
        "Team Meeting: When someone proposes a significant change to how your team operates, your first instinct is to identify risks and reasons why the current approach is better. You need substantial evidence before accepting new methods.",
        "Conflict Situation: When forced to work in unfamiliar ways, you become frustrated and may push back strongly, arguing for return to proven approaches. You find it difficult to let go of how things 'should' be done.",
        "Leadership Moment: When circumstances require pivoting strategy or approach, you need significant time to adjust and may struggle to help your team embrace the change enthusiastically."
      ],
      "developmentTips": [
        "Practice making small changes to your routines deliberately to build comfort with adaptability.",
        "Recognize that resistance to all change may cause you to miss valuable improvements.",
        "Ask yourself whether your preference for the current approach is based on evidence or simply comfort with familiarity.",
        "Partner with more flexible colleagues who can help you evaluate new approaches objectively."
      ]
    },
    "mediumScore": {
      "range": [34, 66],
      "narrative": "You show reasonable adaptability while also valuing some consistency and structure. You're open to change when you understand the rationale and can see potential benefits, but you're not someone who changes just for the sake of novelty. This balanced approach allows you to evolve and improve while maintaining enough stability to be effective. You can work in both stable and dynamic environments, though you may have preferences for one over the other.",
      "stressBehavior": "Under pressure, you may become somewhat more rigid and less open to changes, though not extremely so. Your adaptability decreases as stress increases, leading you to rely more heavily on familiar approaches when you're feeling overwhelmed. Recognition of this pattern helps you push back against it when necessary.",
      "scenarios": [
        "Team Meeting: When change is proposed, you consider both benefits and risks thoughtfully. You're open to new approaches but also ask practical questions about implementation and impact.",
        "Conflict Situation: When required to work differently, you adapt after an initial adjustment period. You may need time to process changes but ultimately make the transition reasonably well.",
        "Leadership Moment: When circumstances shift, you can pivot your approach, though you prefer to make thoughtful transitions rather than abrupt changes. You help your team understand the reasons for change."
      ],
      "developmentTips": [
        "Pay attention to whether you're being appropriately cautious about change or unnecessarily resistant.",
        "Develop frameworks for evaluating when change is beneficial versus when stability is more valuable.",
        "Practice adapting more quickly in low-stakes situations to build confidence for high-stakes changes.",
        "Notice whether certain types of changes are harder for you than others and why."
      ]
    },
    "highScore": {
      "range": [67, 100],
      "narrative": "You thrive on change and adapt easily to new situations, approaches, and requirements. You're comfortable with uncertainty and may actually find stable, repetitive environments boring or constraining. You embrace new ideas readily and are often an early adopter of different methods or technologies. This flexibility makes you valuable in dynamic environments and during organizational changes, though it can sometimes make you impatient with necessary processes or resistant to maintaining consistency.",
      "stressBehavior": "Under pressure, you typically maintain or even increase your flexibility, pivoting quickly as circumstances change. However, this can sometimes lead to changing direction too frequently, confusing others who are trying to keep up with your shifts. In extreme stress, you might become scattered, pursuing multiple different approaches without following through on any.",
      "scenarios": [
        "Team Meeting: When change is proposed, you're often an enthusiastic early supporter, seeing opportunities rather than obstacles. You help others get comfortable with new directions.",
        "Conflict Situation: When plans need to change, you pivot easily and may become impatient with colleagues who need more time to adjust. You don't understand why others find change so difficult.",
        "Leadership Moment: When circumstances shift, you change course quickly and expect your team to adapt at the same pace. You may need to provide more support for those who need time to transition."
      ],
      "developmentTips": [
        "Recognize that some stability and consistency is necessary for team effectiveness—not all change is improvement.",
        "Give others more time and support to adapt to changes that feel easy to you.",
        "Ensure you're following through on initiatives rather than abandoning them when something newer seems more interesting.",
        "Balance your love of change with appreciation for proven processes and approaches that work."
      ]
    }
  },
  "conscientiousness": {
    "name": "Conscientiousness",
    "description": "Your attention to detail, planning, organization, and follow-through.",
    "lowScore": {
      "range": [0, 33],
      "narrative": "You focus on big-picture thinking and forward momentum rather than detailed planning or systematic organization. You're comfortable with spontaneity and may work in a more fluid, adaptive way rather than following detailed plans. You probably start working on things without extensive preparation and figure out details as you go. This approach allows you to be flexible and responsive, but it can lead to missed details, quality issues, or incomplete follow-through on commitments.",
      "stressBehavior": "Under pressure, you're even more likely to skip planning and dive straight into action. You may cut corners to get things done faster, which can result in errors or work that doesn't meet quality standards. Your follow-through on details may become especially weak when you're stressed and focused on just getting to the finish line.",
      "scenarios": [
        "Team Meeting: You contribute big-picture ideas and strategic thinking but may not have thought through implementation details. When asked about specifics, you prefer to figure them out later rather than planning extensively upfront.",
        "Conflict Situation: When a project faces quality issues due to missed details, you may feel frustrated by what seems like excessive focus on small problems rather than overall progress.",
        "Leadership Moment: You energize your team with vision and direction but may struggle to create the detailed plans and tracking systems they need to execute effectively."
      ],
      "developmentTips": [
        "Partner with detail-oriented colleagues who can help catch what you miss and create needed structure.",
        "Build simple systems and checklists for repetitive tasks to ensure consistency without feeling constrained.",
        "Recognize which details genuinely matter for quality and stakeholder expectations versus which are less critical.",
        "Schedule time for planning and organization rather than treating it as optional when you feel busy."
      ]
    },
    "mediumScore": {
      "range": [34, 66],
      "narrative": "You balance attention to important details with maintaining forward momentum and big-picture focus. You plan and organize when the situation warrants it but don't over-engineer every process or decision. You catch most significant details while not getting lost in minor ones. This balanced approach allows you to be both thorough and efficient, adapting your level of conscientiousness to what each situation requires.",
      "stressBehavior": "Under pressure, you may cut back on planning and attention to detail in order to maintain speed and momentum. Your conscientiousness decreases as stress increases, leading you to make more errors or miss more details than usual. Awareness of this pattern helps you decide when to slow down despite pressure.",
      "scenarios": [
        "Team Meeting: You contribute both strategic direction and practical considerations. You've thought through key details without over-planning, and you're prepared without being rigidly attached to your plans.",
        "Conflict Situation: When balancing quality with deadlines, you make conscious trade-offs about which details matter most rather than either perfectionism or carelessness.",
        "Leadership Moment: You provide your team with enough structure and planning to execute well without making them feel micromanaged or constrained by excessive process."
      ],
      "developmentTips": [
        "Develop clear frameworks for when high conscientiousness is critical versus when speed matters more.",
        "Notice your patterns around planning and organization—do they serve the situation or just your comfort level?",
        "Build relationships with both highly detailed and big-picture thinkers to help you calibrate appropriately.",
        "Pay attention to which types of details you naturally catch versus consistently miss, and create systems accordingly."
      ]
    },
    "highScore": {
      "range": [67, 100],
      "narrative": "You approach work with careful attention to detail, thorough planning, and strong follow-through. You create systems and processes to ensure consistency and quality. You probably check your work multiple times and think through implementation details before starting. This thoroughness produces high-quality, reliable results and prevents costly errors. However, it can also slow you down, lead to perfectionism, or cause frustration when working with less detail-oriented colleagues.",
      "stressBehavior": "Under pressure, you may become even more meticulous, checking and rechecking work when speed is needed. Alternatively, if stress becomes extreme, you might experience a reversal where your usual conscientiousness breaks down and you make uncharacteristic errors or skip important steps because you're overwhelmed.",
      "scenarios": [
        "Team Meeting: You arrive prepared with detailed analysis, documentation, and well-thought-through plans. You notice errors or gaps in others' proposals and point them out, which is valuable but can sometimes slow momentum.",
        "Conflict Situation: When others produce work that doesn't meet your quality standards, you may redo it yourself rather than providing feedback, or you may struggle with delegation because you don't trust others to be as thorough.",
        "Leadership Moment: You create clear expectations, detailed plans, and tracking systems for your team. You ensure high-quality output but need to balance this with giving people autonomy and accepting that perfection isn't always necessary."
      ],
      "developmentTips": [
        "Practice distinguishing between situations requiring high precision and those where 'good enough' is sufficient.",
        "Delegate more and resist the urge to redo others' work—coaching them to improve is more sustainable.",
        "Set time limits for planning and checking to prevent perfectionism from becoming procrastination.",
        "Recognize that your attention to detail is a strength, but it becomes a weakness if it prevents action or collaboration."
      ]
    }
  },
  "emotional_intelligence": {
    "name": "Emotional Intelligence",
    "description": "Your awareness of emotions in yourself and others, and ability to navigate interpersonal dynamics.",
    "lowScore": {
      "range": [0, 33],
      "narrative": "You tend to focus on tasks, logic, and outcomes rather than on emotional dynamics or interpersonal nuances. You may not naturally notice or prioritize how people are feeling, and you might find it confusing when emotions seem to override rational decision-making. This focus on objectivity over emotions allows you to make decisions without being swayed by feelings, but it can lead to blind spots around team dynamics, motivation, and relationship management.",
      "stressBehavior": "Under pressure, you become even less attuned to emotional factors, focusing sharply on what needs to get done while becoming impatient with emotional responses or interpersonal concerns. You may dismiss feelings as irrelevant distractions from the work, which can damage relationships and team morale during challenging times.",
      "scenarios": [
        "Team Meeting: You focus on the content of discussions—data, decisions, actions—without noticing undercurrents of tension, disagreement, or disengagement among team members.",
        "Conflict Situation: When someone is upset, you may respond with logical solutions rather than acknowledging their feelings first, which can make them feel dismissed even when your suggestions are valid.",
        "Leadership Moment: You set clear expectations and evaluate performance objectively, but you may miss early signs that team members are struggling, disengaged, or in conflict with each other."
      ],
      "developmentTips": [
        "Practice explicitly asking people how they're feeling and what they need, rather than assuming you know or that it doesn't matter.",
        "Recognize that addressing emotional factors often improves task outcomes rather than detracting from them.",
        "Develop relationships with colleagues who have high emotional intelligence and learn from their approach.",
        "Remember that acknowledging emotions doesn't mean being controlled by them—you can be both logical and empathetic."
      ]
    },
    "mediumScore": {
      "range": [34, 66],
      "narrative": "You show reasonable awareness of emotional factors and interpersonal dynamics while also maintaining focus on tasks and outcomes. You notice when people are upset or when team dynamics are off, though you might not always know exactly how to respond. You balance consideration of feelings with rational decision-making. This middle ground allows you to be effective in most interpersonal situations without becoming overwhelmed by emotional complexity.",
      "stressBehavior": "Under pressure, your emotional awareness typically decreases as you focus more on getting things done and less on how people are feeling. You may become less patient with emotional concerns or interpersonal nuances when you're stressed about deadlines or outcomes. Recognizing this pattern helps you compensate when it matters most.",
      "scenarios": [
        "Team Meeting: You notice when discussions become tense or when someone seems disengaged, and you may address it directly or adjust your approach, though you're not always sure of the best way to respond.",
        "Conflict Situation: When someone is upset, you acknowledge their feelings and attempt to address concerns, balancing empathy with moving toward solutions.",
        "Leadership Moment: You pay attention to both results and team wellbeing, checking in with people periodically and adjusting your approach when you sense issues, though you may miss some subtler dynamics."
      ],
      "developmentTips": [
        "Build stronger skills in reading non-verbal cues and emotional undercurrents in conversations.",
        "Practice staying attuned to emotional factors even when you're focused on tasks or under pressure.",
        "Develop frameworks for how to respond to different emotional situations rather than winging it each time.",
        "Seek feedback on your interpersonal effectiveness to understand blind spots you may have."
      ]
    },
    "highScore": {
      "range": [67, 100],
      "narrative": "You're highly attuned to emotions—both your own and others'. You notice subtle shifts in mood, tension, or engagement, and you naturally consider how people are feeling when making decisions or communicating. You adjust your approach based on others' emotional states and you're skilled at navigating sensitive interpersonal situations. This emotional intelligence makes you effective at building relationships, managing conflict, and creating positive team dynamics. However, you may sometimes prioritize feelings over necessary tough decisions or become overwhelmed by emotional complexity.",
      "stressBehavior": "Under pressure, your response varies. You might maintain your emotional attunement while feeling drained by the emotional weight you carry, or you might experience emotional fatigue that makes you less empathetic than usual. Some people with high emotional intelligence become even more focused on others' feelings during stress, sometimes at the expense of their own needs.",
      "scenarios": [
        "Team Meeting: You notice immediately when someone is upset, disengaged, or in disagreement, even if they're not saying so directly. You may pause to address dynamics before continuing with the agenda.",
        "Conflict Situation: You naturally understand multiple perspectives in a dispute and can articulate what each person is experiencing. You're skilled at finding resolutions that address emotional needs alongside practical concerns.",
        "Leadership Moment: You create psychologically safe environments where people feel comfortable raising concerns. You know your team members well—their motivations, stressors, and how they prefer to work."
      ],
      "developmentTips": [
        "Ensure you're setting boundaries and not taking on everyone's emotional burdens—your empathy is valuable but can be draining.",
        "Balance emotional consideration with willingness to make difficult decisions that may upset people but are necessary.",
        "Remember that understanding how someone feels doesn't mean you have to fix it or take responsibility for it.",
        "Use your emotional intelligence strategically rather than letting it overwhelm your judgment or capacity."
      ]
    }
  }
}
